print ("---โปรแกรมคำนวณช่วงอายุในแต่ละ วัยเด็ก , วัยรุ่น , วัยผู้สูงอายุ---")
name = input("ใส่ชื่อของคุณ : ")
age = int(input("ใส่อายุของคุณ : "))
print ("------------------------------------------------------")
if age <= 18:
    print (f"ชื่อของคุณ : {name}")
    print (f"อายุของคุณ : {age}")
    print ("ช่วงอายุของคุณคือ : วัยเด็ก")
elif age <= 45:
    print (f"ชื่อของคุณ : {name}")
    print (f"อายุของคุณ : {age}")
    print ("ช่วงอายุของคุณคือ : วัยรุ่น")
else :
    print (f"ชื่อของคุณ : {name}")
    print (f"อายุของคุณ : {age}")
    print ("ช่วงอายุของคุณคือ : ผู้สูงอายุ")
print ("------------------------------------------------------\n")

def showoverlay ():
    print ("---โปรแกรมคำนวณช่วงอายุในแต่ละ วัยเด็ก , วัยรุ่น , วัยผู้สูงอายุ---")
def input_data ():
    in_name = input("ใส่ชื่อของคุณ : ")
    in_age = int(input("ใส่อายุของคุณ : "))
    return in_name , in_age
def chackandshow (in_name , in_age):
    if age <= 18:
        print (f"ชื่อของคุณ : {in_name} / อายุของคุณ : {in_age} ")
        print ("ช่วงอายุของคุณคือ : วัยเด็ก")
    elif age <= 45:
        print (f"ชื่อของคุณ : {in_name} / อายุของคุณ : {in_age} ")
        print ("ช่วงอายุของคุณคือ : วัยรุ่น")
    else :
        print (f"ชื่อของคุณ : {in_name} / อายุของคุณ : {in_age} ")
        print ("ช่วงอายุของคุณคือ : ผู้สูงอายุ")

print ("------------------------------------------------------")
showoverlay()
print ("------------------------------------------------------")
in_name , in_age = input_data()
print ("------------------------------------------------------")
chackandshow (in_name , in_age)
print ("------------------------------------------------------")